#เลขเงินหาจำนวนแบงค์

a=int(input("จำนวนเงินที่ฝาก :"))

if a>=1000 :
    print("1000 บาท",a//1000,"ใบ")
    a=a%1000
    print("100บาท",a//100,"ใบ")
    a=a%100
    print("10บาท",a//10,"ใบ")
    a=a%10
    print("1บาท",a//1,"ใบ")
if a>=100 :
    print("100บาท",a//100,"ใบ")
    a=a%100
    print("10บาท",a//10,"ใบ")
    a=a%10
    print("1บาท",a//1,"ใบ")
if a>=10 :
    print("10บาท",a//10,"ใบ")
    a=a%10
    print("1บาท",a//1,"ใบ")
if a>=1 :
    print("1บาท",a//1,"ใบ")

    
            
    
    
